const parseExp = /\[(\d{2}):(\d{2})\.(\d{2,3})\]/;


export function ParseLyric(lyricString) {
  const lineStrings = lyricString && lyricString.split('\n');
  const lyrics = [];

  for (const line of lineStrings) {
    const result = parseExp.exec(line);
    if (!result) continue;
    const time1 = result[1] * 60 * 1000;
    const time2 = result[2] * 1000;
    const time3 = result[3].length === 3 ? result[3] * 1 : result[3] * 10;

    const time = time1 + time2 + time3;
    const content = line.replace(parseExp,"").trim();
    const id = uuid();
    const lineObj = { id , time , content };
    lyrics.push(lineObj);
  }
  return lyrics;
}
 function	uuid() {
	var i, random;
	var uuid = '';
 
	for (i = 0; i < 32; i++) {
		random = Math.random() * 16 | 0;
		if (i === 8 || i === 12 || i === 16 || i === 20) {
			uuid += '-';
		}
		// eslint-disable-next-line no-mixed-operators
		uuid += (i === 12 ? 4 : (i === 16 ? (random & 3 | 8) : random))
			.toString(16);
	}
 
	return uuid;
}

// [00:00.000] 作曲 : 朱斌语
// [00:01.000] 作词 : 朱斌语
// [00:04.39]编曲：王中易
// [00:12.61]
// [00:15.16]要想练就绝世武功
// [00:17.15]就要忍受常人难忍受的痛
// [00:20.42]师傅喜欢喝的茶叫做乌龙
// [00:22.81]衣服爱穿中国红(嘿  师傅）
// [00:26.17]无论是炎夏或寒冬
// [00:28.68]我都很向往山门外的天空
// [00:31.83]还在南方等我 下山的我
// [00:35.00]的人叫小落
// [00:38.06]我左手一式太极拳
// [00:40.87]右手一剑刺身前
// [00:43.79]扫腿这招叫清雪
// [00:46.66]破轻功飞燕
// [00:49.44]我奇筋异脉力破天
// [00:52.41]一身正气荡人间
// [00:55.40]除暴安良我心愿
// [00:58.16]老师傅再见
// [01:01.77]
// [01:13.40]要想练就绝世武功
// [01:15.56]就要忍受常人难忍受的痛
// [01:18.78]师傅喜欢喝的茶叫做乌龙
// [01:21.28]衣服爱穿中国红（师傅）
// [01:24.68]无论是炎夏或寒冬
// [01:27.23]我都很向往山门外的天空
// [01:30.23]还在南方等我 下山的我
// [01:33.43]的人叫小落（来）
// [01:36.54]我左手一式太极拳
// [01:39.40]右手一剑刺身前
// [01:42.35]扫腿这招叫清雪
// [01:45.13]破轻功飞燕
// [01:48.08]我奇筋异脉力破天
// [01:50.98]一身正气荡人间
// [01:53.98]除暴安良我心愿
// [01:56.76]老师傅再见
// [02:00.16](人法地~地法天~天法道~道法孜然 师..师傅，什么是孜然）
// [02:11.64]我左手一式太极拳
// [02:14.35]右手一剑刺身前
// [02:17.30]扫腿这招叫清雪
// [02:20.22]破轻功飞燕
// [02:23.11]我奇筋异脉力破天
// [02:26.06]一身正气荡人间
// [02:28.99]除暴安良我心愿
// [02:32.00]老师傅再见
// [02:35.35]
// [02:36.32]制作人：王中易
// [02:37.00]和声：朱斌语／涵木之／陈迪庭
// [02:37.15]混音：王宇呈
// [02:38.16]配唱：王中易／谭佳瑶
// [02:39.03]统筹：谭佳瑶
// [02:40.04]制作公司/录音室：Hikoon
// [02:40.99]OP：嗨库文化